Repository: 15458434/Finally-it-is
Catalog: Finally it is/*.lproj/Localizable.strings
Languages: nl

source: 5 pm
nl: 5 uur

source: Feedback on Finally it is
nl: Feedback voor Is het al

source: Finally it is
nl: Is het al

source: Finally it is 5 pm
nl: Het is eindelijk 5 uur

source: Finally it is Friday
nl: Het is eindelijk vrijdag

source: Finally it is weekend
nl: Het is eindelijk weekend

source: Friday
nl: Vrijdag

source: Have a wonderful evening doing the stuff you love to do!
nl: Heb een leuke avond met datgene wat je leuk vind om te doen

source: Have a wonderful weekend and don't care about your work!
nl: Heb een fijn weekend en je hoeft je niet druk te maken om je werk

source: No
nl: Nee

source: Yes
nl: Ja

source: You're almost there
nl: Nog eventjes en dan heb je weekend
